In [3]:
import pandas as pd

In [ ]:
# Task 1

data = {
    'Name': ['Alex', 'Bella', 'Chris'],
    'Age': [30, 25, 35],
    'City': ['Kyiv', 'Lviv', 'Odesa']
}
df = pd.DataFrame(data)

df["Salary"] = [50000, 60000, 55000]

df = df.drop("Age", axis=1)

new_row = {'Name': 'Diana', 'City': 'Dnipro', 'Salary': 58000}

df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

df = df.drop(df.index[0])

df["Deparment"] = "Sales"

df = df.drop("Salary", axis=1)

df

    Name    City Deparment
1  Bella    Lviv     Sales
2  Chris   Odesa     Sales
3  Diana  Dnipro     Sales

In [ ]:
# Task 2

data = {
    'Product': ['Book', 'Pen', 'Notebook'],
    'Price': [15, 2, 5],
    'Stock': [100, 500, 200]
}
df = pd.DataFrame(data)

df["Discount"] = "10%"

df = df.drop("Stock", axis=1)

new_row = {'Product': 'Pencil', 'Price': 1, 'Discount': '5%'}

df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

df = df.drop(df.index[1], axis=0)

df["Supplier"] = "Stationery Co."

df = df.drop(df.index[2], axis=0)

df

    Product  Price Discount        Supplier
0      Book     15      10%  Stationery Co.
2  Notebook      5      10%  Stationery Co.